tutorials/pnpMultiFoam/twoDRandomPore/system/blockMeshDict_cycl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\i*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L 1;
D 1;
H 1;

vertices
(
    (0 0 0)
    ($L 0 0)
    ($L $D 0)
    (0 $D 0)
    (0 0 $H)
    ($L 0 $H)
    ($L $D $H)
    (0 $D $H)
);

blocks
(
    hex (0 1 2 3 4 5 6 7 ) (500 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 5 6 2)
        );
    }
    upperWall
    {
        type cyclic;
        neighbourPatch lowerWall;
        faces
        (
            (3 2 6 7)
        );
    }
    lowerWall
    {
        type cyclic;
        neighbourPatch upperWall;
        faces
        (
            (0 4 5 1)
        );
    }
    zMin
    {
        type cyclic;
        neighbourPatch zMax;
        faces
        (
            (0 1 2 3)
        );
    }
    zMax
    {
        type cyclic;
        neighbourPatch zMin;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
