tutorials/pnpMultiFoam/twoDRandomPore/0/fluid/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinitial;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform $Uinitial;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform $Uinitial;
    }
    lowerWall
    {
        type            symmetry;
    }
    upperWall
    {
        type            symmetry;
    }
    emptyWall
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            noSlip;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
