tutorials/pnpMultiFoam/twoDRandomPore/0/fluid/C.Na
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C.Na;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            symmetry;
    }
    upperWall
    {
        type            symmetry;
    }
    emptyWall
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            fixedValue;
        value           uniform $cSolid;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
