tutorials/pnpMultiFoam/twoDRandomPore/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    lowerWall
    {
        type            symmetry;
        value           $internalField;
    }
    upperWall
    {
        type            symmetry;
        value           $internalField;
    }
    emptyWall
    {
        type            empty;
    }
    solid_to_fluid
    {
        type            fixedValue;
        value           $internalField;
    }
}



// ************************************************************************* //
