tutorials/pnpMultiFoam/twoDRandomPore/system/PostSampleFluid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

// Sample along the outlet
start   (0.001 0 0);
end     (0.001 0 0.001);
fields  (C.Cl C.Na grad(V));

region fluid;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here

interpolationScheme cellPointFace;

setConfig
{
    type lineUniform;
    axis z;        // y, z, xyz
    nPoints 5000;
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //